# A × B = {(a,b)∣ a∈A та b∈B}
"""
👉 «Декартовий добуток множин A і B — це множина всіх упорядкованих пар 
(a,b), де 
    a належить множині A, а 
    b належить множині B».
"""

"""
У Python декартів добуток можна обчислити двома способами.
Перший спосіб, це використання функції product з модуля itertools. 
Ця функція створює всі можливі комбінації елементів двох множин, 
після чого результат можна перетворити на множину.
"""
from itertools import product

A = {1, 2}
B = {'x', 'y', 'z'}

cartesian = set(product(A, B))
print("A × B:", cartesian)
print("Кількість елементів:", len(cartesian))

"""
Другий спосіб можна реалізувати через set comprehension.
Він формує декартів добуток шляхом послідовного перебору 
всіх елементів першої множини та всіх елементів другої, 
де кожний можливий варіант поєднання утворює пару.
"""

A = {1, 2}
B = {'x', 'y', 'z'}

cartesian = {(a, b) for a in A for b in B}
print("A × B:", cartesian)
