"""
Факторіал — одна з найважливіших функцій у комбінаториці. 
Вона описує кількість способів впорядкувати об'єкти.
Факторіал натурального числа n — це добуток всіх натуральних чисел від 1 до n включно.
"""

"""
Перестановка — це впорядкування елементів множини.

Іншими словами, це відповідь на запитання: скількома різними способами 
можна розташувати n різних об'єктів?
Перестановка з n елементів — це впорядкований набір усіх цих елементів. Pₙ = n!
"""

# Для перестановок в Python є функція math.factorial(n), яка обчислює 
# n! - кількість перестановок з n елементів.

import math

# 3 елементи
result = math.factorial(3)
print(f"Кількість перестановок з 3 елементів: {result}")

# 5 розробників
team_orders = math.factorial(5)
print(f"Способів розсадити 5 розробників: {team_orders}")

# Якщо потрібно не просто порахувати, а отримати всі можливі варіанти перестановок, 
# використовуємо itertools.permutations(iterable).

from itertools import permutations

items = ['A', 'B', 'C']

# Генеруємо всі перестановки
all_permutations = list(permutations(items))

print(f"Кількість перестановок: {len(all_permutations)}")
print("Всі перестановки:")
for perm in all_permutations:
    print(''.join(perm))
