"""
Приклад 1. Множина голосних літер
"""
# Повторення не враховуються
B = {"a", "e", "i", "o", "u"}
print(B)  

# Перевіряємо приналежність
print("a" in B)  
print("b" in B) 

"""
Коли елементів дуже багато або їх взагалі нескінченна кількість, 
перерахувати всі неможливо. Тоді ми описуємо не самі елементи, а правило, 
яке визначає, чи належить об'єкт множині.
"""


"""
Приклад 2. Множина всіх парних чисел: 
Парне число — це таке число, яке ділиться на 2 без остачі. 
Іншими словами, будь-яке парне число можна записати як добуток 2 на деяке ціле число k.
Математично: E={x∣ x=2k, k∈Z}, де Z — множина цілих чисел, 2k - парне число.
"""
E = {x for x in range(-100, 101) if x % 2 == 0}

"""
Приклад 3. Множина додатних чисел менших за 100:
F={x∣ 0<x<100}
"""
F = {x for x in range(1, 100)}

# ⚠️ У Python таку множину задати неможливо буквально, бо вона нескінченна.
# Можливі наближення:
# а) Через крок (дискретизація):

import numpy as np

F = np.arange(0, 100, 0.1)


#б) Як логічну умову:

def in_F(x: float) -> bool:
    return 0 < x < 100

print("~" * 20)

B = {1, 2, 2, 3, 3, 3}

# Потужність множини
print(len(B)) 

# Порожня множина
C = set()  
print(len(C)) 
