"""
У соцмережі є два списки:
    A — користувачі, які вподобали пост про котів
    B — користувачі, які вподобали пост про собак
Тоді 
    A∪B — це всі користувачі, які вподобали хоча б один з цих постів. 
    Якщо хтось вподобав обидва пости, він все одно буде в множині тільки один раз.
"""

# Об'єднання множин A і B — це нова множина, яка містить всі елементи, що належать хоча б одній з цих множин.
A = {1, 2, 3}
B = {3, 4, 5}

# Два способи зробити те саме
C = A.union(B)
print(C)

C = A | B
print(C)

print("~" * 20)

"""
Нехай 
    A={1,2,3,4} і 
    B={3,4,5,6}. 
Які елементи є в обох множинах? Тільки 3 і 4. 
Отже, 
    A ∩ B = {3, 4}.
"""

# Перетин множин A і B — це множина елементів, які належать і A, і B одночасно.

A = {1, 2, 3, 4}
B = {3, 4, 5, 6}

C = A.intersection(B)
print(C)

# Або через оператор &
C = A & B
print(C)

"""
Формально, дві множини A і B неперетинні якщо їх перетином є порожня множина, тобто якщо
A ∩ B = ∅.
"""

A = {1, 2, 3}
B = {4, 5, 6}

intersection = A & B

print(intersection)        # set() A ∩ B
print(len(intersection))   # 0 ∅

# Або
C = A.isdisjoint(B)
print(C)
print("~" * 20)

"""
Різниця множин A і B — це елементи, які належать A, але не належать B. 
Позначається 
    A∖B або просто A−B.
Формально: 
    A∖B = {x∣ x ∈ A і x ∈ /B}

На відміну від об'єднання і перетину, тут порядок критично важливий: 
    A∖B != B∖A.
"""

# Різниця

A = {1, 2, 3, 4, 5}
B = {3, 4, 5, 6, 7}

# Різниця A без B (що є в А, чого нема в B)
C = A.difference(B)
print("A - B:", C)

# Через оператор
C = A - B
print("A - B:", C)

# Зворотна різниця B без A (що є в B, чого нема в A)
D = B - A
print("B - A:", D)

print("~" * 20)

"""
Симетрична різниця множин A і B — це елементи, які належать або A, або B, 
але не обом одночасно. 
Беремо те, що належить А і не належить B і те, що є в B і не належить А та об'єднуємо.

Позначається 
    A△B.

Іншими словами, ми беремо все, крім спільних елементів. 
Формально це можна записати двома способами:
    A△B = (A ∖ B) ∪ (B ∖ A)
    A△B = (A ∪ B) ∖ (A ∩ B)

На відміну від звичайної різниці, симетрична різниця комутативна: 
    A△B=B△A. 
"""

A = {1, 2, 3, 4}
B = {3, 4, 5, 6}

C = A.symmetric_difference(B)
print(C)

# Або через оператор ^
C = A ^ B
print(C)

