"""
Задача 1. Операції над множинами

У нас є база користувачів сервісу.
Позначимо:
    Множина всіх користувачів: U={u1,u2,u3,u4,u5,u6}
    Користувачі, які підписані на розсилку: A={u1,u2,u4,u5}
    Користувачі, які купили платну підписку: B={u2,u3,u5}
"""

from itertools import permutations
from itertools import combinations
from itertools import product
U = {"u1", "u2", "u3", "u4", "u5", "u6"}
A = {"u1", "u2", "u4", "u5"}
B = {"u2", "u3", "u5"}

# Знайти множину користувачів, які або підписані на розсилку,
# або мають платну підписку (або і те, і те)

either = A.union(B)        # або A | B
print(either)

# Знайти множину користувачів, які одночасно і підписані на розсилку,
# і мають платну підписку

inter = A.intersection(B)  # або A & B
print(inter)

# Знайти множину користувачів, які підписані на розсилку,
# але не мають платної підписки
# Різниця A без B (що є в А, чого нема в B)

C = A.difference(B)     # або A - B
print("A - B:", C)

"""
Задача 2. Підмножини та рівність множин
Умова
Розглянемо множини:
A={1,2,3,4}
B={2,3}
C={4,3,2,1}
D=∅
"""

A = {1, 2, 3, 4}
B = {2, 3}
C = {4, 3, 2, 1}
D = set()

# Перевіряємо, чи виконується B⊆A.
# 👉 «Множина B є підмножиною множини A» або
# 👉 «B міститься в A»

if B <= A:
    print("B⊆A")

# Перевіряємо, чи виконується A = C.

if A == C:
    print("A=C")

# Перевіряємо, чи виконується D⊆A.

if D <= A:
    print("D⊆A")

# Або дуже коротко

print("B⊆A:", B <= A)
print("A=C:", A == C)
print("D⊆A:", D <= A)


"""
Задача 3. Симетрична різниця та декартів добуток
Умова
Дано множини:
A={1,2,3,4}
B={3,4,5,6}
"""

A = {1, 2, 3, 4}
B = {3, 4, 5, 6}

# Обчислюємо симетричну різницю множин A та B

C = A.symmetric_difference(B)    # або A ^ B
print("Симетрична різниця: ", C)

# Обчислюємо декартів добуток A×{x,y}


XY = {"x", "y"}
cartesian = set(product(A, XY))
print("A × {x, y}:", cartesian)

"""
Задача 7. Вибір команди
Умова
Є 5 студентів: S={“s1”, “s2", “s3”, “s4", “s5”}

Треба сформувати команду з 2 осіб. Порядок не має значення.
Скільки різних команд можна створити?
"""

S = {"s1", "s2", "s3", "s4", "s5"}


# Генеруємо всі можливі двійки
all_teams = list(combinations(S, 2))

print(f"Всього варіантів команд: {len(all_teams)}")
for i, team in enumerate(all_teams, 1):
    print(f"{i}. {', '.join(team)}")


"""
Задача 8. Розсадка
Умова
Є 6 студентів: S1 = {"s1", "s2", "s3", "s4", "s5", "s6"}
Є 3 стільці в ряду: (1),(2),(3)
Потрібно посадити 3 різних студентів на 3 різні місця. Порядок важливий.
Скільки існує можливих варіантів посадки?
"""
from itertools import permutations
import itertools 

S1 = {"s1", "s2", "s3", "s4", "s5", "s6"}

three_seats = list(itertools.permutations(S1, 3))
print("Кількість сопособів розсадити студентів:", len(three_seats))
print("Перші 5 варіантів:", three_seats[:5])


"""
Задача 9. Всі порядки символів
Умова
Є 4 різні літери: L={a,b,c,d}
Потрібно знайти кількість різних способів розташувати ці 4 букви в ряд.
Порядок має значення. Повторень немає.
"""

L = {"a", "b", "c", "d"}

order = list(itertools.permutations(L, len(L)))
print("Кількість сопособів розташувати 4 букви в ряд:", len(order))
print("Перші 5 варіантів:", order[:5])