"""
Задача 1. Робота з зображеннями як з матрицями
"""

import numpy as np

M = np.array([
    [100, 150, 200],
    [50, 100, 150],
    [0, 50, 100]
])

E = np.array([
    [20, 30, 40],
    [10, 20, 30],
    [5, 10, 15]
])

"""
Зміна контрасту. Необхідно зменшити яскравість зображення M. 
Це множення матриці на скаляр (число) λ. 
Кожен елемент матриці множиться на це число 0.5.
"""

contrast = 0.5 * M

print(f"Зміна контрасту: \n {contrast}")

"""
Корекція яскравості. Це додавання скаляра c до матриці M. 
Число додається до кожного елемента матриці. 
Додайте до зображення M число 25. Це збільшить яскравість кожного пікселя на 25.
"""

brightness = 25 + M

print(f"Зміна яскравості: \n {brightness}")

"""
Змішування (Blending). Ми створюємо нове зображення, змішуючи оригінал та ефект у певній пропорції. 
Для цього створи нове зображення як лінійну комбінацію: 0.8⋅M + 0.2⋅E. Це імітує прозорість ефекту.
"""

blending = (0.8 * M) + (0.2 * E)

print(f"Нове зображення: \n {blending}")

