"""
Вартість доставки
Умова
Нехай вартість доставки посилки описується функцією двох змінних:
    w — вага в кілограмах
    d — відстань у кілометрах
Модель:
    C(w, d) = 2w + 0.01d
Потрібно:
    1. Обчислити C(5, 100).
    2. Обчислити C(10, 100).
    3. Пояснити, що означає факт, що C залежить від двох змінних, а не від однієї.
"""

# Функція вартості доставки
def C(w, d):
    return 2*w + 0.01*d

# Обчислення
c1 = C(5, 100)
c2 = C(10, 100)

print(f"C(5, 100) = {c1}")
print(f"C(10, 100) = {c2}")
