import numpy as np

# П'ятивимірний вектор
w = np.array([1, -2, 3, 0, 4])
norm_w = np.linalg.norm(w)
print(f"\nВектор w = {w}")
print(f"Норма ||w|| = {norm_w:.2f}")

# Дві точки на площині (координати)
A = np.array([1, 2])
B = np.array([4, 6])

# Відстань = норма вектора різниці
distance = np.linalg.norm(B - A)

print(f"Точка A: {A}", f"Точка B: {B}")
print(f"Вектор B - A: {B - A}")
print(f"Відстань d(A, B) = ||B - A|| = {distance}")

"""
Розглянемо практичний приклад на знаходження найближчого сусіда.
Припустимо, у нас є набір даних міст з їх координатами
і ми хочемо знайти найближче місто до заданої точки.
"""

# Координати міст (широта, довгота) - звісно спрощено
cities = np.array([
    [50.45, 30.52],   # Київ
    [48.29, 25.94],   # Чернівці
    [49.84, 24.03],   # Львів
    [46.48, 30.73],   # Одеса
    [49.99, 36.23]    # Харків
])

city_names = ['Київ', 'Чернівці', 'Львів', 'Одеса', 'Харків']

# Наша поточна позиція де-небудь в районі Вінниці ;)
P = np.array([49.23, 28.47])

print(f"Поточна локація P: {P}")
print("\nВідстані до міст:")

# Обчислюємо відстані до всіх міст
distances = []
for i, city_coords in enumerate(cities):
    dist = np.linalg.norm(city_coords - P)
    distances.append(dist)
    print(f"  {city_names[i]}: {dist:.2f}") # f — число типу float; .2 — показати рівно 2 знаки після коми; значення округлюється

# Знаходимо найближче місто
nearest_idx = np.argmin(distances)
print(f"\nНайближче місто: {city_names[nearest_idx]}")
print(f"Відстань: {distances[nearest_idx]:.2f}")


"""
Процес перетворення довільного ненульового вектора в одиничний називається нормалізацією. 
Щоб нормалізувати вектор v, треба поділити його на його ж норму
"""
# Довільний вектор
v = np.array([3, 4])
print(f"Оригінальний вектор: v = {v}")
print(f"Норма: ||v|| = {np.linalg.norm(v)}")

# Нормалізація
v_normalized = v / np.linalg.norm(v)
print(f"\nНормалізований вектор: v̂ = {v_normalized}")
print(f"Норма нормалізованого: ||v̂|| = {np.linalg.norm(v_normalized)}")

# Перевірка: нормалізований вектор має норму 1
print(f"Норма дорівнює 1? {np.isclose(np.linalg.norm(v_normalized), 1.0)}")